#include "welcome.h"

#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

#include "center.h"

int menuSelect() {
    int choice;

    while (1) {
        system("clear");
        title();
        sleep(2);
        menu();

        printf("\nВведите номер пункта: ");
        scanf("%d", &choice);

        if (choice >= 1 && choice <= 3)
            return choice;
        else {
            printf("Неверный ввод. Попробуйте снова.\n");
            getchar();
            getchar();
        }
    }
}

void title() {
    printCentered(
        "█████╗   ██████╗  ██████   ██████╗  ██████╗      ██████╗   ██████╗ ██╗      █████╗  ██╗   ██╗ ███████╗ █████╗ "
        " ████████╗");
    printCentered(
        "██╔══██╗ ██╔═══██╗██╔═══  ╗██╔══██╗██╔═══██╗    ██╔═══██╗ ██╔═══██╗██║     ██╔══██╗ ██║   ██║ "
        "██╔════╝██╔══██╗ ╚══██╔══╝");
    printCentered(
        "██║  ██║ ██║   ██║██║█████║██████╔╝██║   ██║    ██║   ██║ ██║   ██║██║     ███████║ ██║   ██║ █████╗  "
        "███████║    ██║   ");
    printCentered(
        "██║  ██║ ██║   ██║██║   ██║██╔══██╗██║   ██║    ██║   ██║ ██║   ██║██║     ██╔══██║ ██║   ██║ ██╔══╝  "
        "██╔══██║    ██║   ");
    printCentered(
        "╚█████╔╝ ╚██████╔╝╚██████╔╝██║  ██║╚██████╔╝    ██║   ██║ ╚██████╔╝███████╗██║  ██║ ╚██████╔╝ ███████╗██║  "
        "██║    ██║   ");
    printCentered(
        " ╚════╝   ╚═════╝  ╚═════╝ ╚═╝  ╚═╝ ╚═════╝     ╚═╝   ╚═╝  ╚═════╝ ╚══════╝╚═╝  ╚═╝  ╚═════╝  ╚══════╝╚═╝  "
        "╚═╝    ╚═╝   ");
}

void menu() {
    printf("┌─────────────────────────────────────┐\n");
    printf("│                                     │\n");
    printf("│          [1]Начать игру             │\n");
    printf("│                                     │\n");
    printf("│                                     │\n");
    printf("│          [2]Продолжить              │\n");
    printf("│                                     │\n");
    printf("├─────────────────────────────────────┤\n");
    printf("│           [3]Кредиты                │\n");
    printf("└─────────────────────────────────────┘\n");
}